Book_Shopping/app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
---
  def index
    @product = Product.order(:title).page(params[:page]).per(3)